# ElementsBelongToOtherCircuit Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElectricalFailures..::..ElementsBelongToOtherCircuit Property
BuiltInFailures..::..ElectricalFailures Class See Also
---
You have selected elements that are already part of other Circuits that have assigned Panels. The elements you selected cannot be added to this Circuit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ElementsBelongToOtherCircuit { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElementsBelongToOtherCircuit As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ElementsBelongToOtherCircuit {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElectricalFailures Class
Autodesk.Revit.DB Namespace